benchmarks/lora/definitive_results/performance_analysis/loading_overhead/throughput/with_pre_loading/llama-2-7b/p25_dataset/_1_8__256_run_2/log_13076325.out
WARNING 12-16 17:49:39 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=17941, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=256, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/theory/lora_overhead/throughput/pre_loading/llama-2-7b/p25_dataset/_1_8__256_run_2', launch_server=True, server_args='--port=17941 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --enable-lora --lora-modules=sql-lora=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b/lora/yard1_sql-lora-test_dummy_rank_8/ --max-num-seqs=4096 --max-loras=1 --max-lora-rank=8', disable_log_stats=False, disable_loras_users=False, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None, lora_pre_loading=True)
Server started
Requests users. Values: ['0']. Counts: [256]
Requests loras. Values: ['sql-lora']. Counts: [256]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     256       
Benchmark duration (s):                  4.24      
Total input tokens:                      5888      
Total generated tokens:                  6912      
Request throughput (req/s):              60.42     
Input token throughput (tok/s):          1389.74   
Output token throughput (tok/s):         1631.44   
---------------Time to First Token----------------
Mean TTFT (ms):                          890.94    
Median TTFT (ms):                        940.97    
P99 TTFT (ms):                           1139.12   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          127.76    
Median TPOT (ms):                        125.67    
P99 TPOT (ms):                           134.66    
---------------Inter-token Latency----------------
Mean ITL (ms):                           127.17    
Median ITL (ms):                         88.95     
P99 ITL (ms):                            519.30    
==================================================
Concurrent checker terminated
Server terminated